In [3]:
import pandas as pd

### 데이터 불러오기

#### CSV

In [4]:
friend_list = pd.read_csv('data/friend_list.csv')

In [5]:
friend_list

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [6]:
friend_list.head(5)

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [7]:
friend_list.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [8]:
friend_list.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

#### txt
- csv 파일 형식으로 저장되어 있으면 csv로 불러오면 된다

In [9]:
friend_list_txt = pd.read_csv('data/friend_list.txt')

In [10]:
friend_list_txt

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

#### ,가 아닌 tab으로 데이터가 구분

In [11]:
friend_list_tab = pd.read_csv('data/friend_list_tab.txt')

In [12]:
friend_list_tab

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [15]:
friend_list_tab = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [16]:
friend_list_tab

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

#### Header 정보가 없을 경우

In [17]:
friend_list_noHeader = pd.read_csv('data/friend_list_no_head.csv')

In [18]:
friend_list_noHeader

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [20]:
friend_list_noHeader = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [21]:
friend_list_noHeader

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [22]:
friend_list_noHeader.columns = ['name', 'age', 'job']

In [23]:
friend_list_noHeader

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [24]:
friend_list_noHeader = pd.read_csv('data/friend_list_no_head.csv', 
                                   header = None, 
                                   names = ['name', 'age', 'job']
                                  )

In [25]:
friend_list_noHeader

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern